# Exercise for Numpy

In [1]:
import numpy as np
import pandas as pd
import random as rd
# import matplotlib.pyplot as plt
# import seaborn as sns
# import sklearn as sk

In [2]:
# sale = mon, tue, wed, thur, fri,
# Item_1, Item_2, Item_3
# sale  = TOTAL SALES
np.random.seed(seed = True)
item_amount = np.random.randint(20, size = (5,3))
item_amount

array([[ 5, 11, 12],
       [ 8,  9, 11],
       [ 5, 15,  0],
       [16,  1, 12],
       [ 7, 13,  6]])

In [3]:
item_price = np.array([12,8,11])

In [4]:
item_price_df = pd.DataFrame(item_price.reshape(1,3),
                             index =['Item_Price'],
                             columns = ['item_1','item_2','item_3'])

In [28]:
item_price_df

            item_1  item_2  item_3
Item_Price      12       8      11

In [26]:
total_price1 = item_price.dot(item_amount.T)
total_price1

array([280, 289, 180, 332, 254])

In [29]:
total_price = pd.DataFrame(total_price1.T, columns = ["Total_Price"], index = ["Mon", 'Tue', 'Wed', 'Thur', 'Fri'])
total_price

      Total_Price
Mon           280
Tue           289
Wed           180
Thur          332
Fri           254

In [30]:
weekly_sales = pd.DataFrame(item_amount, columns = ["Item_1", 'Item_2', 'Item_3'], index = ["Mon", 'Tue', 'Wed', 'Thur', 'Fri'])

In [31]:
weekly_sales

      Item_1  Item_2  Item_3
Mon        5      11      12
Tue        8       9      11
Wed        5      15       0
Thur      16       1      12
Fri        7      13       6

In [49]:
weekly_sales['Total_Price'] = total_price

In [50]:
weekly_sales

      Item_1  Item_2  Item_3  Total_Price
Mon        5      11      12          280
Tue        8       9      11          289
Wed        5      15       0          180
Thur      16       1      12          332
Fri        7      13       6          254

In [47]:
del weekly_sales[weekly_sales.columns[3]]

In [48]:
weekly_sales

      Item_1  Item_2  Item_3
Mon        5      11      12
Tue        8       9      11
Wed        5      15       0
Thur      16       1      12
Fri        7      13       6

# Comparison Operator